ningjw/LPC55S69/core0/board/pin_mux.h
/*! @name PIO1_1 (coord G11), TEMP_ALT
  @{ */
#define BOARD_TEMP_ALT_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_TEMP_ALT_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_TEMP_ALT_PIN 1U    /*!<@brief 1U pin index: 1 */
                                 /* @} */

/*! @name PIO0_14 (coord C13), TMP_SCL
  @{ */
#define BOARD_TMP_SCL_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_TMP_SCL_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_TMP_SCL_PIN 14U   /*!<@brief 0U pin index: 14 */
                                /* @} */

/*! @name PIO0_13 (coord C12), TMP_SDA
  @{ */
#define BOARD_TMP_SDA_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_TMP_SDA_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_TMP_SDA_PIN 13U   /*!<@brief 0U pin index: 13 */
                                /* @} */

/*! @name PIO1_13 (coord B3), FLASH_MOSI
  @{ */
#define BOARD_FLASH_MOSI_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_FLASH_MOSI_PIN 13U /*!<@brief 1U pin index: 13 */
                                 /* @} */

/*! @name PIO1_16 (coord C7), FLASH_MISO
  @{ */
#define BOARD_FLASH_MISO_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_FLASH_MISO_PIN 16U /*!<@brief 1U pin index: 16 */
                                 /* @} */

/*! @name PIO1_12 (coord F12), FLASH_SCK
  @{ */
#define BOARD_FLASH_SCK_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_FLASH_SCK_PIN 12U /*!<@brief 1U pin index: 12 */
                                /* @} */

/*! @name PIO0_31 (coord L1), FLASH_RESET
  @{ */
#define BOARD_FLASH_RESET_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_FLASH_RESET_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_FLASH_RESET_PIN 31U   /*!<@brief 0U pin index: 31 */
                                    /* @} */

/*! @name PIO1_17 (coord J9), FLASH_WP
  @{ */
#define BOARD_FLASH_WP_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_FLASH_WP_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_FLASH_WP_PIN 17U   /*!<@brief 1U pin index: 17 */
                                 /* @} */

/*! @name PIO0_4 (coord E7), WIFI_RTS
  @{ */
#define BOARD_WIFI_RTS_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_WIFI_RTS_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_WIFI_RTS_PIN 4U    /*!<@brief 0U pin index: 4 */
                                 /* @} */

/*! @name PIO0_30 (coord E5), ADC_MISO
  @{ */
#define BOARD_ADC_MISO_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_ADC_MISO_PIN 30U /*!<@brief 0U pin index: 30 */
                               /* @} */

/*! @name PIO0_28 (coord F13), ADC_SPI_SCK
  @{ */
#define BOARD_ADC_SPI_SCK_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_ADC_SPI_SCK_PIN 28U /*!<@brief 0U pin index: 28 */
                                  /* @} */

/*! @name PIO0_27 (coord N2), NB_RXD
  @{ */
#define BOARD_NB_RXD_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_NB_RXD_PIN 27U /*!<@brief 0U pin index: 27 */
                             /* @} */

/*! @name PIO0_26 (coord H12), NB_TXD
  @{ */
#define BOARD_NB_TXD_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_NB_TXD_PIN 26U /*!<@brief 0U pin index: 26 */
                             /* @} */

/*! @name PIO0_15 (coord L2), FLASH_CS
  @{ */
#define BOARD_FLASH_CS_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_FLASH_CS_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_FLASH_CS_PIN 15U   /*!<@brief 0U pin index: 15 */
                                 /* @} */

/*! @name PIO1_4 (coord B2), FLT_CLK
  @{ */
#define BOARD_FLT_CLK_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_FLT_CLK_PIN 4U  /*!<@brief 1U pin index: 4 */
                              /* @} */

/*! @name PIO0_0 (coord L12), ADC_CLK
  @{ */
#define BOARD_ADC_CLK_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_ADC_CLK_PIN 0U  /*!<@brief 0U pin index: 0 */
                              /* @} */

/*! @name PIO0_1 (coord F5), SPD_FREQ_CAP
  @{ */
#define BOARD_SPD_FREQ_CAP_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_SPD_FREQ_CAP_PIN 1U  /*!<@brief 0U pin index: 1 */
                                   /* @} */

/*! @name PIO1_9 (coord C1), selFREQ
  @{ */
#define BOARD_selFREQ_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_selFREQ_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_selFREQ_PIN 9U    /*!<@brief 1U pin index: 9 */
                                /* @} */

/*! @name PIO0_5 (coord A7), WIFI_CTS
  @{ */
#define BOARD_WIFI_CTS_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_WIFI_CTS_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_WIFI_CTS_PIN 5U    /*!<@brief 0U pin index: 5 */
                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
